# Grace's Brew File
tap "gyoder/graceful-tap", trusted: true



# Programming Languages
brew "go"
brew "rustup", postinstall: "${HOMEBREW_PREFIX}/opt/rustup/bin/rustup-init -y && ${HOMEBREW_PREFIX}/opt/rustup/bin/rustup component add rust-analyzer"
brew "uv"
brew "llvm"
brew "cmake"
brew "make"
brew "just"
brew "node"
brew "npm"
brew "typescript"
brew "typst"
brew "zig"
brew "python@3.13"

# Shell Stuff
brew "fish"
brew "fzf"
brew "pfetch-rs"
brew "sesh"
brew "starship"
brew "gyoder/graceful-tap/jj-starship"
brew "tmux"
brew "zoxide"
brew "zellij"

# Editor Stuff
brew "gyoder/graceful-tap/neovim-nightly"
brew "tree-sitter"
brew "tree-sitter-cli"

# Language Servers
brew "codebook-lsp"
go "golang.org/x/tools/gopls"
brew "tinymist"
brew "zls"
brew "vscode-langservers-extracted"
brew "typescript-language-server"
brew "fish-lsp"
uv "ruff"
uv "pyright"

# Git Stuff
brew "gh"
brew "jj"

# CLI Utils
brew "ripgrep"
brew "dust"
brew "tree"
brew "stow"
brew "btop"
brew "curl"
brew "fd"
brew "uutils-coreutils"
brew "wget"
brew "jq"
brew "yq"
brew "yj"
brew "most"

# Random
brew "tailscale"
brew "sqlite"
brew "asciinema"
brew "bash"
brew "openssh"
brew "openssl"
brew "container", postinstall: "container system start" if OS.mac?
brew "podman"

